app/controllers/movies_controller.rb

  def index
    @sort = params[:sort]
    @movies = Movie.order(@sort).all
---
SELECT "movies".* FROM "movies"